import Iconify from "@/components/icon/Iconify";
import Image from "next/image";

export default function page() {
    return (
        <main className='about-us-page'>

            <div className="right">
                <Image
                    src="/images/about-us/1.png"
                    alt=""
                    fill />
            </div>

            <div className="left">
                <h1>
                    درباره ی ممبرلند :
                </h1>
                <p>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
                </p>
                <div className="contacts">


                    <div className="item">
                        <span>
                            Exmaple@gmail.com
                            <svg xmlns="http://www.w3.org/2000/svg" width="37" height="37" viewBox="0 0 37 37" fill="none">
                                <path d="M26.6952 22.66C26.6952 24.172 27.1254 24.775 28.2504 24.775C30.7578 24.775 32.3544 21.58 32.3544 16.2664C32.3544 8.14483 26.436 4.25683 19.047 4.25683C11.4456 4.25683 4.53179 9.35443 4.53179 18.988C4.53179 28.1896 10.5798 33.2008 19.8678 33.2008C23.0214 33.2008 25.1382 32.8552 28.3764 31.7752L29.0712 34.6678C25.8744 35.7064 22.458 36.007 19.8246 36.007C7.64219 36.007 1.11719 29.311 1.11719 18.9862C1.11719 8.57503 8.67899 1.49023 19.0902 1.49023C29.9334 1.49023 35.6772 7.97023 35.6772 15.919C35.6772 22.6582 33.5622 27.799 26.9094 27.799C23.8836 27.799 21.8982 26.5894 21.639 23.9092C20.8614 26.89 18.7878 27.799 15.978 27.799C12.2196 27.799 9.06599 24.9028 9.06599 19.0726C9.06599 13.1974 11.8326 9.56863 16.8006 9.56863C19.4358 9.56863 21.0774 10.6054 21.8082 12.247L23.0628 9.95743H26.6916V22.66H26.6952ZM21.3834 16.9576C21.3834 14.5834 19.6104 13.588 18.1416 13.588C16.5432 13.588 14.7738 14.8822 14.7738 18.6856C14.7738 21.7096 16.113 23.3944 18.1416 23.3944C19.5672 23.3944 21.3834 22.4872 21.3834 19.9816V16.9576Z" fill="url(#paint0_linear_191_4090)" />
                                <defs>
                                    <linearGradient id="paint0_linear_191_4090" x1="18.3972" y1="1.49023" x2="18.3972" y2="36.007" gradientUnits="userSpaceOnUse">
                                        <stop stopColor="#D602FC" />
                                        <stop offset="1" stopColor="#0D4BF4" />
                                    </linearGradient>
                                </defs>
                            </svg>
                        </span>
                    </div>

                    <div className="item">
                        <span>
                            98123456789+
                            <svg xmlns="http://www.w3.org/2000/svg" width="41" height="41" viewBox="0 0 41 41" fill="none">
                                <path d="M9.12991 16.684C12.3297 23.652 18.0152 29.1747 25.0732 32.1707L26.2066 32.6757C27.4616 33.2345 28.8736 33.3325 30.1938 32.9523C31.514 32.5721 32.6577 31.7381 33.4232 30.5973L34.9049 28.3907C35.1368 28.0446 35.2306 27.6243 35.168 27.2124C35.1054 26.8006 34.8908 26.4272 34.5666 26.1657L29.5466 22.1157C29.3717 21.9747 29.1702 21.8705 28.9541 21.8094C28.7381 21.7483 28.5118 21.7315 28.2891 21.76C28.0663 21.7884 27.8516 21.8617 27.6579 21.9752C27.4641 22.0887 27.2953 22.2403 27.1616 22.4207L25.6082 24.5157C21.6209 22.5464 18.3934 19.3183 16.4249 15.3307L18.5182 13.7773C18.6987 13.6436 18.8502 13.4748 18.9637 13.281C19.0772 13.0873 19.1505 12.8726 19.1789 12.6498C19.2074 12.4271 19.1906 12.2008 19.1295 11.9848C19.0684 11.7687 18.9642 11.5672 18.8232 11.3923L14.7732 6.37233C14.5117 6.04809 14.1383 5.83352 13.7265 5.7709C13.3147 5.70828 12.8943 5.80214 12.5482 6.034L10.3266 7.524C9.17891 8.29363 8.34172 9.44569 7.96416 10.7749C7.5866 12.1042 7.69318 13.5243 8.26491 14.7823L9.12991 16.684Z" fill="url(#paint0_linear_191_4055)" />
                                <defs>
                                    <linearGradient id="paint0_linear_191_4055" x1="21.4646" y1="5.75195" x2="21.4646" y2="33.1801" gradientUnits="userSpaceOnUse">
                                        <stop stopColor="#D602FC" />
                                        <stop offset="1" stopColor="#0D4BF4" />
                                    </linearGradient>
                                </defs>
                            </svg>
                        </span>
                    </div>


                </div>

            </div>

        </main>
    )
}
